//========================================================================
//	爱好者电子工作室-淘宝 https://devotee.taobao.com/
//	STM32四轴爱好者QQ群: 810149456
//	作者：小刘
//	电话:13728698082
//	邮箱:1042763631@qq.com
//	日期：2018.05.17
//	版本：V1.0
//========================================================================
// 套件购买地址：https://devotee.taobao.com/
//                 爱好者电子工作室
// 特此声明：
//
//         此程序只能用作学习，如用商业用途。必追究责任！
//
//
//
#include "sys.h"

#undef SUCCESS
#define SUCCESS 0
#undef FAILED
#define FAILED 1
#define ZY_31_SLAVE_ADDRESS 0xC0
#define MODULE_REST 0x20
#define MPU6050_GET_OFFSET 0x21
#define MS5611_GET_OFFSET 0x22
#define MPU_READ 0X30
#define ANGLE_READ 0X32

#define HEIGHT_READ 0X33
#define RATE_READ 0X34

/******************************************************************/

/***********************************************************************
 *
 * @param[in]
 * @param[out]
 * @return
 **********************************************************************/

///***********************************************************************
// *
// * @param[in]
// * @param[out]
// * @return
// **********************************************************************/
// float height;

/********************************END OF FILE*****************************************/
